Revit 2027 API
ParameterTypeId.StructuralFoundationLength Property
 "Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralFoundationLength { get; }
Public Shared ReadOnly Property StructuralFoundationLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralFoundationLength {
	ForgeTypeId^ get ();
}
static member StructuralFoundationLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace